#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/statuc_devops/armageddon-github-actions/runs/run-YP15oTN7i2mDebmg

Waiting for the plan to start...

Terraform v1.10.4
on linux_amd64
Initializing plugins and modules...
data.aws_route53_zone.main: Refreshing...
data.aws_ami.latest-amazon-linux-image: Refreshing...
aws_eip.eip_NY: Refreshing state... [id=eipalloc-0d81b007b34ce7b40]
aws_vpc.VPC-B-NewYork-Test: Refreshing state... [id=vpc-0bc9cab2b3a99f81c]
aws_ec2_transit_gateway.VPC-B-NewYork-Test-TGW01: Refreshing state... [id=tgw-0b8f2a2ef36f7e999]
data.aws_route53_zone.main: Refresh complete after 0s [id=Z103851437PNELROEQ0AM]
aws_vpc.VPC-G-California-Test: Refreshing state... [id=vpc-0cdd2498c6fc982d5]
aws_ec2_transit_gateway.VPC-G-California-TGW01: Refreshing state... [id=tgw-05f3755bdce121fac]
aws_eip.eip_California: Refreshing state... [id=eipalloc-07b61ab812c323918]
aws_vpc.VPC-C-London-Test: Refreshing state... [id=vpc-0544bdfc19cfb1915]
aws_eip.eip_LONDON: Refreshing state... [id=eipalloc-0c28305f51305c690]
data.aws_ami.latest-amazon-linux-image: Refresh complete after 0s [id=ami-0ac4dfaf1c5c0cce9]
aws_ec2_transit_gateway.VPC-C-London-Test-TGW01: Refreshing state... [id=tgw-022be57ac7e3a859c]
aws_eip.eip_SaoPaulo: Refreshing state... [id=eipalloc-06e0d115f8dcf7e4c]
aws_ec2_transit_gateway.VPC-D-SaoPaulo-TGW01: Refreshing state... [id=tgw-0704683c150d48a67]
aws_vpc.VPC-D-SaoPaolo-Test: Refreshing state... [id=vpc-00e6367b5d809c39b]
aws_ec2_transit_gateway.Tokyo-Region-TGW: Refreshing state... [id=tgw-08c1853c0d27ee239]
aws_vpc.VPC-A-Tokyo-Test: Refreshing state... [id=vpc-0e904473fabbf4c7d]
aws_vpc.VPC-DB: Refreshing state... [id=vpc-09ff87dfe01974f1f]
data.aws_region.tokyo: Refreshing...
data.aws_region.tokyo: Refresh complete after 0s [id=ap-northeast-1]
aws_vpc.VPC-Cyber-Tokyo: Refreshing state... [id=vpc-0185dbc37b727050a]
aws_eip.eip_TYO: Refreshing state... [id=eipalloc-093dcbc01ff1f4b05]
aws_subnet.private-us-east-1a: Refreshing state... [id=subnet-0333e2859d8562fea]
aws_security_group.ASG01-SG02-NY-TG80: Refreshing state... [id=sg-07d12c67cd9e928ff]
aws_subnet.private-us-east-1b: Refreshing state... [id=subnet-0fc59622491238d5a]
aws_subnet.public-us-east-1b: Refreshing state... [id=subnet-0d3cf9b98152ecc3d]
aws_lb_target_group.ASG01_NY_TG01: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:261519058382:targetgroup/ASG01-NewYork-target-group/13c8d52e9c049938]
aws_security_group.ASG01-SG01-NY-LB01: Refreshing state... [id=sg-0e54aad822b6f82c6]
aws_security_group.ASG01-SG03-NY-servers: Refreshing state... [id=sg-0567c00601939e117]
aws_internet_gateway.igw_NY: Refreshing state... [id=igw-0dc260ed485e01e99]
aws_subnet.public-us-east-1a: Refreshing state... [id=subnet-0e57427e44110273a]
aws_eip.eip_Australia: Refreshing state... [id=eipalloc-03c73601e891fc9c4]
aws_ec2_transit_gateway.VPC-E-AUS-TGW01: Refreshing state... [id=tgw-0095ca3d666275da8]
aws_vpc.VPC-E-Australia-Test: Refreshing state... [id=vpc-03515546d37e6d6ef]
aws_ec2_transit_gateway_peering_attachment.LON-to-CYBER-Tokyo: Refreshing state... [id=tgw-attach-099a91d7b19d99f14]
aws_ec2_transit_gateway_peering_attachment.CALI-to-CYBER-Tokyo: Refreshing state... [id=tgw-attach-02ef935062494e2d9]
aws_ec2_transit_gateway_peering_attachment.NY-to-CYBER-Tokyo: Refreshing state... [id=tgw-attach-017483c03e81be3f6]
aws_ec2_transit_gateway_peering_attachment.SAO-to-CYBER-Tokyo: Refreshing state... [id=tgw-attach-033164d10e947a85b]
aws_ec2_transit_gateway_vpc_attachment.VPC-B-NewYork-US-EAST-1A-TGA01: Refreshing state... [id=tgw-attach-007c6d46294abec6a]
aws_launch_template.app1_NewYork_LT: Refreshing state... [id=lt-0a13abe69bbabd532]
aws_route_table.public_NY: Refreshing state... [id=rtb-0a0e3c791abcb3aed]
aws_nat_gateway.nat_NY: Refreshing state... [id=nat-0dfbc4b31595bb137]
aws_lb.ASG01-NY-LB01: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:261519058382:loadbalancer/app/ASG01-NewYork-load-balancer/12b30bb1be2a9d13]
aws_eip.eip_HongKong: Refreshing state... [id=eipalloc-0a7182ee34270191c]
aws_ec2_transit_gateway.VPC-F-HongKong-TGW01: Refreshing state... [id=tgw-03d086da89a0b274f]
aws_vpc.VPC-F-HongKong-Test: Refreshing state... [id=vpc-0779a3c77e9cea5fc]
aws_ec2_transit_gateway_peering_attachment.AUS-to-CYBER-Tokyo: Refreshing state... [id=tgw-attach-02db687589f1bd9c4]
aws_ec2_transit_gateway_peering_attachment_accepter.Accept-LON-Peer: Refreshing state... [id=tgw-attach-099a91d7b19d99f14]
aws_ec2_transit_gateway_peering_attachment_accepter.Accept-NY-Peer: Refreshing state... [id=tgw-attach-017483c03e81be3f6]
aws_lb_target_group.ASG01_CALI_TG01: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-1:261519058382:targetgroup/ASG01-California-target-group/766b6d2ecd2d5240]
aws_subnet.public-us-west-1b: Refreshing state... [id=subnet-0657842b45e37f8c1]
aws_subnet.public-us-west-1a: Refreshing state... [id=subnet-0c0f0cf63da550261]
aws_security_group.ASG01-SG03-CALI-servers: Refreshing state... [id=sg-096245601faa92d19]
aws_subnet.private-us-west-1a: Refreshing state... [id=subnet-0ed8845ee788ef05e]
aws_security_group.ASG01-SG01-CALI-LB01: Refreshing state... [id=sg-0edad8f535443235a]
aws_security_group.ASG01-SG02-CALI-TG80: Refreshing state... [id=sg-09a7486965fa1fa82]
aws_internet_gateway.igw_CALI: Refreshing state... [id=igw-06fafe35787c52d32]
aws_subnet.private-us-west-1b: Refreshing state... [id=subnet-0a8ad55da53169e98]
aws_ec2_transit_gateway_peering_attachment_accepter.Accept-CALI-Peer: Refreshing state... [id=tgw-attach-02ef935062494e2d9]
aws_autoscaling_group.ASG01_NY: Refreshing state... [id=ASG01-NewYork-auto-scaling-group20250125120400877900000003]
aws_route_table_association.public-us-east-1b: Refreshing state... [id=rtbassoc-0ad05f2c8a70a3d6d]
aws_route_table_association.public-us-east-1a: Refreshing state... [id=rtbassoc-03994745b51445b00]
aws_route_table.private_NY: Refreshing state... [id=rtb-0f033129461b14d69]
aws_route53_record.app1_NY: Refreshing state... [id=Z103851437PNELROEQ0AM_app1.devlab405.click_A_app1_NY]
aws_lb_listener.http_NY: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:261519058382:listener/app/ASG01-NewYork-load-balancer/12b30bb1be2a9d13/81cac0944ab59333]
aws_ec2_transit_gateway_peering_attachment_accepter.Accept-SAO-Peer: Refreshing state... [id=tgw-attach-033164d10e947a85b]
aws_security_group.ASG01-SG02-LONDON-TG80: Refreshing state... [id=sg-04e6792f3ced885f6]
aws_subnet.private-eu-west-2b: Refreshing state... [id=subnet-05f567bdf9c678dde]
aws_internet_gateway.igw_LON: Refreshing state... [id=igw-0e30288b36b6be44f]
aws_subnet.public-eu-west-2b: Refreshing state... [id=subnet-04bcc7b9a5735a787]
aws_lb_target_group.ASG01_LON_TG01: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-2:261519058382:targetgroup/ASG01-London-target-group/4fdb85cce2bb99b2]
aws_security_group.ASG01-SG01-LONDON-LB01: Refreshing state... [id=sg-07be70954268aeaa1]
aws_subnet.private-eu-west-2a: Refreshing state... [id=subnet-093dc6219fd4f89dc]
aws_subnet.public-eu-west-2a: Refreshing state... [id=subnet-05cd8071dd3cbcfee]
aws_security_group.ASG01-SG03-LONDON-servers: Refreshing state... [id=sg-07d579dc3b945712e]
aws_ec2_transit_gateway_peering_attachment.HK-to-CYBER-Tokyo: Refreshing state... [id=tgw-attach-0cb50c2f94e3ce117]
aws_ec2_transit_gateway_peering_attachment_accepter.Accept-AUS-Peer: Refreshing state... [id=tgw-attach-02db687589f1bd9c4]
aws_ec2_transit_gateway_route.London-TokyoCYBER: Refreshing state... [id=tgw-rtb-02a3c70f9f0cdaa23_10.19.0.0/16]
aws_ec2_transit_gateway_route.TokyoCYBER-London: Refreshing state... [id=tgw-rtb-0dda6ab5cea3e200a_10.22.0.0/16]
aws_launch_template.app1_California_LT: Refreshing state... [id=lt-06f11181453686bdc]
aws_subnet.private-sa-east-1c: Refreshing state... [id=subnet-0bdc3aa6c2f02ec37]
aws_security_group.ASG01-SG02-SAO-TG80: Refreshing state... [id=sg-00af5be9142b95e6e]
aws_lb_target_group.ASG01_SAO_TG01: Refreshing state... [id=arn:aws:elasticloadbalancing:sa-east-1:261519058382:targetgroup/ASG01-SaoPAulo-target-group/564c7aa8e1dcbcc8]
aws_subnet.private-sa-east-1a: Refreshing state... [id=subnet-076736316a6562cba]
aws_security_group.ASG01-SG03-SAO-servers: Refreshing state... [id=sg-084ac1a6e9ef97a17]
aws_internet_gateway.igw_SAO: Refreshing state... [id=igw-06428ca7f4e895b35]
aws_subnet.public-sa-east-1a: Refreshing state... [id=subnet-06d7dcacd93642288]
aws_subnet.public-sa-east-1c: Refreshing state... [id=subnet-047ea390aaf4bd594]
aws_security_group.ASG01-SG01-SAO-LB01: Refreshing state... [id=sg-0924b6975047f615a]
aws_lb.ASG01-CALI-LB01: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-1:261519058382:loadbalancer/app/ASG01-California-load-balancer/d754a8119aa2705d]
aws_ec2_transit_gateway_route.TokyoCYBER-NewYork: Refreshing state... [id=tgw-rtb-0dda6ab5cea3e200a_10.21.0.0/16]
aws_ec2_transit_gateway_route.NewYork-TokyoCYBER: Refreshing state... [id=tgw-rtb-05b6bb307b1d0c352_10.19.0.0/16]
aws_autoscaling_attachment.ASG01_NY_attachment: Refreshing state... [id=ASG01-NewYork-auto-scaling-group20250125120400877900000003-20250125120827799000000004]
aws_autoscaling_policy.app1_NY_scaling_policy: Refreshing state... [id=app1-cpu-target]
aws_nat_gateway.nat_California: Refreshing state... [id=nat-0eb6f62998dc1f269]
aws_route_table.public_California: Refreshing state... [id=rtb-09e80c47c6cbdd3a7]
aws_route_table_association.private-us-east-1b: Refreshing state... [id=rtbassoc-0f6bb82c34a222e59]
aws_route_table_association.private-us-east-1a: Refreshing state... [id=rtbassoc-0a309506173de3254]
aws_ec2_transit_gateway_vpc_attachment.VPC-G-California-TGA01: Refreshing state... [id=tgw-attach-00f5400f9c5398317]
aws_route_table.public_London: Refreshing state... [id=rtb-06b3db9382a1f6928]
aws_security_group.Aurora-DB-SG01: Refreshing state... [id=sg-0c7034d1759101ac1]
aws_internet_gateway.DB_VPC_TYO_IGW: Refreshing state... [id=igw-0ba8df262236579dd]
aws_subnet.private-db-ap-northeast-1a: Refreshing state... [id=subnet-084ab80ab7e3fe8de]
aws_subnet.private-db-northeast-1c: Refreshing state... [id=subnet-05913f87bbf3a160f]
aws_route_table.private_DB_VPC_Tokyo: Refreshing state... [id=rtb-056bac9db7ba7bd1d]
aws_subnet.public-ap-northeast-1a: Refreshing state... [id=subnet-0522b7af9df69a52f]
aws_subnet.public-ap-northeast-1c: Refreshing state... [id=subnet-0ebc99e1ccc1135b1]
aws_subnet.private-ap-northeast-1c: Refreshing state... [id=subnet-0936ac1c57e6f45d4]
aws_internet_gateway.igw_TYO: Refreshing state... [id=igw-08ab20fcbdb0afd32]
aws_subnet.private-ap-northeast-1a: Refreshing state... [id=subnet-06b26b80ee2f44fd9]
aws_security_group.ASG01-SG01-TYO-LB01: Refreshing state... [id=sg-083aeee4035d9aeff]
aws_security_group.ASG01-SG02-TYO-TG80: Refreshing state... [id=sg-0aeec47b8d529244f]
aws_lb_target_group.ASG01_TYO_TG01: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:261519058382:targetgroup/ASG01-Tokyo-target-group/137b72d9b1f9d18b]
aws_security_group.ASG01-SG03-TYO-servers: Refreshing state... [id=sg-0a43ec71799074ee7]
aws_security_group.SG02-TYO-CYBER-NLB01: Refreshing state... [id=sg-03067d6cff54cd53e]
aws_route_table.private_CYBER_Tokyo: Refreshing state... [id=rtb-0f4decdd91d278aa6]
aws_lb_target_group.CYBER_TYO_TG02: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:261519058382:targetgroup/CYBER-TYO-TG02/859111406c8ac6e7]
aws_internet_gateway.igw_CYBER_TYO: Refreshing state... [id=igw-006844229ba5c5568]
aws_subnet.private-cyber-ap-northeast-1d: Refreshing state... [id=subnet-0a33afea870aca66a]
aws_security_group.SG01-CYBER-TYO-SYSLOG: Refreshing state... [id=sg-020db7aa7b394f28e]
aws_subnet.private-cyber-ap-northeast-1c: Refreshing state... [id=subnet-01fac3156517bac74]
aws_ec2_transit_gateway_route.California-TokyoCYBER: Refreshing state... [id=tgw-rtb-0fdfe7ffe81426604_10.19.0.0/16]
aws_ec2_transit_gateway_route.TokyoCYBER-California: Refreshing state... [id=tgw-rtb-0dda6ab5cea3e200a_10.26.0.0/16]
aws_launch_template.app1_London_LT: Refreshing state... [id=lt-042c8f5dea28f66a0]
aws_ec2_transit_gateway_route.SaoPaulo-TokyoCYBER: Refreshing state... [id=tgw-rtb-03cac00ac2d88140e_10.19.0.0/16]
aws_ec2_transit_gateway_route.TokyoCYBER-SaoPaulo: Refreshing state... [id=tgw-rtb-0dda6ab5cea3e200a_10.23.0.0/16]
aws_ec2_transit_gateway_vpc_attachment.VPC-C-London-TGA01: Refreshing state... [id=tgw-attach-0d86a98c92055badf]
aws_nat_gateway.nat_LONDON: Refreshing state... [id=nat-0c910c2b43b7e76ce]
aws_lb.ASG01-LON-LB01: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-2:261519058382:loadbalancer/app/ASG01-London-load-balancer/6666285c1698ab01]
aws_ec2_transit_gateway_peering_attachment_accepter.Accept-HK-Peer: Refreshing state... [id=tgw-attach-0cb50c2f94e3ce117]
aws_autoscaling_group.ASG01_CALI: Refreshing state... [id=ASG01-California-auto-scaling-group20250125120525925600000003]
aws_ec2_transit_gateway_vpc_attachment.VPC-D-SaoPaulo-TGA01: Refreshing state... [id=tgw-attach-0d9ead054a4a17471]
aws_ec2_transit_gateway_route.Australia-TokyoCYBER: Refreshing state... [id=tgw-rtb-0b7d4266645d4012e_10.19.0.0/16]
aws_ec2_transit_gateway_route.TokyoCYBER-Australia: Refreshing state... [id=tgw-rtb-0dda6ab5cea3e200a_10.24.0.0/16]
aws_launch_template.app1_SaoPaulo_LT: Refreshing state... [id=lt-02c7b61ba6fb25ff4]
aws_route_table.public_SaoPaolo: Refreshing state... [id=rtb-040905fb8229fa9d7]
aws_nat_gateway.nat_SaoPaulo: Refreshing state... [id=nat-0912c4ded06fb3310]
aws_lb.ASG01-SAO-LB01: Refreshing state... [id=arn:aws:elasticloadbalancing:sa-east-1:261519058382:loadbalancer/app/ASG01-SaoPaulo-load-balancer/eedebabe4b3d121e]
aws_route_table.private_California: Refreshing state... [id=rtb-017745bc4dc60e987]
aws_route_table_association.public-us-west-1b: Refreshing state... [id=rtbassoc-04fd18acd70404e6a]
aws_route_table_association.public-us-west-1a: Refreshing state... [id=rtbassoc-01ca739d061bcb55c]
aws_route_table_association.public-eu-west-2b: Refreshing state... [id=rtbassoc-051c4852d776fab9e]
aws_route_table_association.public-eu-west-2a: Refreshing state... [id=rtbassoc-032ca4bccb26fc845]
aws_lb_listener.http_CALI: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-1:261519058382:listener/app/ASG01-California-load-balancer/d754a8119aa2705d/ae24b20098c711d9]
aws_route53_record.app1_CALI: Refreshing state... [id=Z103851437PNELROEQ0AM_app1.devlab405.click_A_app1_CALI]
aws_security_group.ASG01-SG01-AUS-LB01: Refreshing state... [id=sg-0661247449ca0438f]
aws_subnet.private-ap-southeast-2b: Refreshing state... [id=subnet-0a66adcc2a0c14937]
aws_security_group.ASG01-SG03-AUS-servers: Refreshing state... [id=sg-04c260e77a7563405]
aws_security_group.ASG01-SG02-AUS-TG80: Refreshing state... [id=sg-0bc12fd89e64c3c51]
aws_internet_gateway.igw_AUS: Refreshing state... [id=igw-08e1239bbd33702e2]
aws_subnet.public-ap-southeast-2a: Refreshing state... [id=subnet-0efb3af7fa8628e7f]
aws_subnet.private-ap-southeast-2a: Refreshing state... [id=subnet-08a45157f1dcc7675]
aws_subnet.public-ap-southeast-2b: Refreshing state... [id=subnet-0bcf7122b057ff8af]
aws_lb_target_group.ASG01_AUS_TG01: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-2:261519058382:targetgroup/ASG01-Australia-target-group/5377439f4883cae3]
aws_route_table_association.private-db-ap-northeast-1a: Refreshing state... [id=rtbassoc-0c3ed3545edc3749f]
aws_ec2_transit_gateway_vpc_attachment.DB-VPC-TGA01: Refreshing state... [id=tgw-attach-0348692288c4b593f]
aws_route_table_association.private-db-northeast-1c: Refreshing state... [id=rtbassoc-05bfcc476faa7ae77]
aws_db_subnet_group.db_vpc_subnet_group: Refreshing state... [id=db-vpc-subnet-group]
aws_route_table.public_Tokyo: Refreshing state... [id=rtb-017a870f1d5d4f74f]
aws_nat_gateway.nat_TYO: Refreshing state... [id=nat-08debf7de8c76db87]
aws_lb.ASG01-TYO-LB01: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:261519058382:loadbalancer/app/ASG01-Tokyo-load-balancer/6e1757a5f19e7e1d]
aws_ec2_transit_gateway_vpc_attachment.VPC-A-Tokyo-TGA01: Refreshing state... [id=tgw-attach-0e81a2ad676b21f3f]
aws_launch_template.app1_Tokyo_LT: Refreshing state... [id=lt-0b5c715e98bd040a4]
aws_internet_gateway.igw_HK: Refreshing state... [id=igw-0017acd198e2b5ee1]
aws_subnet.public-ap-east-1b: Refreshing state... [id=subnet-0bc55ee95d4d2dfc3]
aws_lb_target_group.ASG01_HK_TG01: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-east-1:261519058382:targetgroup/ASG01-HongKong-target-group/b59fcd8b68615c9e]
aws_security_group.ASG01-SG01-HongKong-LB01: Refreshing state... [id=sg-0ccda1d334ce30c03]
aws_subnet.public-ap-east-1a: Refreshing state... [id=subnet-0bac95ee984468d5b]
aws_security_group.ASG01-SG03-HongKong-servers: Refreshing state... [id=sg-0f260fe8caf42829d]
aws_subnet.private-ap-east-1b: Refreshing state... [id=subnet-0a52b3f00c36ab4bb]
aws_subnet.private-ap-east-1a: Refreshing state... [id=subnet-037af9479a50842ab]
aws_security_group.ASG01-SG02-HongKong-TG80: Refreshing state... [id=sg-06ac430a49c916615]
aws_ec2_transit_gateway_vpc_attachment.VPC-Cyber-Tokyo-TGA: Refreshing state... [id=tgw-attach-07cc70200326ec6ca]
aws_route_table_association.private-cyber-ap-northeast-1d: Refreshing state... [id=rtbassoc-0f968518a1c39ddfe]
aws_launch_template.SYSLOG_Tokyo_LT: Refreshing state... [id=lt-0124f18acfbb52fa9]
aws_lb.CYBER-TYO-NLB01: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:261519058382:loadbalancer/net/CYBER-Tokyo-Network-LB/e795230110463110]
aws_route_table_association.private-cyber-ap-northeast-1c: Refreshing state... [id=rtbassoc-04cd1335bc8157193]
aws_autoscaling_group.ASG01_LON: Refreshing state... [id=ASG01-London-auto-scaling-group20250125120536137900000003]
aws_route_table.private_London: Refreshing state... [id=rtb-0bcaee59ee20e025a]
aws_autoscaling_policy.app1_CALI_scaling_policy: Refreshing state... [id=app1-cpu-target]
aws_autoscaling_attachment.ASG01_CALI_attachment: Refreshing state... [id=ASG01-California-auto-scaling-group20250125120525925600000003-20250125120929175600000004]
aws_lb_listener.http_LON: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-2:261519058382:listener/app/ASG01-London-load-balancer/6666285c1698ab01/eb702b0b0fecca52]
aws_route53_record.app1_LON: Refreshing state... [id=Z103851437PNELROEQ0AM_app1.devlab405.click_A_europe-load-balancer]
aws_route_table_association.public-sa-east-1a: Refreshing state... [id=rtbassoc-064e56f98f3028903]
aws_route_table_association.public-sa-east-1c: Refreshing state... [id=rtbassoc-06eb56c0ae439ad45]
aws_route_table.private_SaoPaulo: Refreshing state... [id=rtb-061806cb505611f79]
aws_route_table_association.private-us-west-1a: Refreshing state... [id=rtbassoc-08b5fd3fb45fd94f7]
aws_route_table_association.private-us-west-1b: Refreshing state... [id=rtbassoc-085ce0cd00a592af0]
aws_ec2_transit_gateway_route.TokyoCYBER-HongKong: Refreshing state... [id=tgw-rtb-0dda6ab5cea3e200a_10.25.0.0/16]
aws_ec2_transit_gateway_route.HongKong-TokyoCYBER: Refreshing state... [id=tgw-rtb-053113a7bce69beee_10.19.0.0/16]
aws_autoscaling_group.ASG01_SAO: Refreshing state... [id=ASG01-SaoPaulo-auto-scaling-group20250125120655034300000003]
aws_launch_template.app1_Australia_LT: Refreshing state... [id=lt-0bf120d88c900574a]
aws_route_table.public_Australia: Refreshing state... [id=rtb-098a8df5c3707e4f0]
aws_nat_gateway.nat_Australia: Refreshing state... [id=nat-0a0f6824690dea260]
aws_ec2_transit_gateway_vpc_attachment.VPC-E-AUS-TGA01: Refreshing state... [id=tgw-attach-05e4a725eedd67ef4]
aws_lb_listener.http_SAO: Refreshing state... [id=arn:aws:elasticloadbalancing:sa-east-1:261519058382:listener/app/ASG01-SaoPaulo-load-balancer/eedebabe4b3d121e/3ceee68de5537d9d]
aws_route53_record.app1_SAO: Refreshing state... [id=Z103851437PNELROEQ0AM_app1.devlab405.click_A_app1_SAO]
aws_lb.ASG01-AUS-LB01: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-2:261519058382:loadbalancer/app/ASG01-Australia-load-balancer/da2bb45b4b7218e4]
aws_route_table_association.public-ap-northeast-1a: Refreshing state... [id=rtbassoc-0ddf2f30686852308]
aws_route_table_association.public-ap-northeast-1c: Refreshing state... [id=rtbassoc-0ce885ccbf06b107e]
aws_route_table.private_Tokyo: Refreshing state... [id=rtb-047c99a42f45c2352]
aws_route_table.public_HongKong: Refreshing state... [id=rtb-0595f35987c4387d2]
aws_autoscaling_group.ASG01_TYO: Refreshing state... [id=ASG01-Tokyo-auto-scaling-group20250125120825876500000005]
aws_lb_listener.http_TYO: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:261519058382:listener/app/ASG01-Tokyo-load-balancer/6e1757a5f19e7e1d/0aff77eb4cafbcbd]
aws_route53_record.tokyo: Refreshing state... [id=Z103851437PNELROEQ0AM_app1.devlab405.click_A_ap-northeast-1]
aws_launch_template.app1_HongKong_LT: Refreshing state... [id=lt-0a388bbe5a1c897cc]
aws_nat_gateway.nat_HongKong: Refreshing state... [id=nat-01f654df491e70f61]
aws_lb.ASG01-HK-LB01: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-east-1:261519058382:loadbalancer/app/ASG01-HongKong-load-balancer/0d63ba5ba9a0a3ad]
aws_ec2_transit_gateway_vpc_attachment.VPC-F-HongKong-TGA01: Refreshing state... [id=tgw-attach-044e245f479ea4d58]
aws_autoscaling_attachment.ASG01_LON_attachment: Refreshing state... [id=ASG01-London-auto-scaling-group20250125120536137900000003-20250125120933940600000004]
aws_autoscaling_policy.app1_LON_scaling_policy: Refreshing state... [id=app1-cpu-target]
aws_route_table_association.private-eu-west-2b: Refreshing state... [id=rtbassoc-056bffc82f39e3a84]
aws_route_table_association.private-eu-west-2a: Refreshing state... [id=rtbassoc-0fb26eee30979f577]
aws_autoscaling_group.TYO_CYBER_ASG: Refreshing state... [id=Tokyo-CYBER-auto-scaling-group20250125120829092000000006]
aws_route_table_association.private-sa-east-1a: Refreshing state... [id=rtbassoc-091dcc28106741b78]
aws_route_table_association.private-sa-east-1c: Refreshing state... [id=rtbassoc-05c748c1ad40d9003]
aws_autoscaling_attachment.ASG01_SAO_attachment: Refreshing state... [id=ASG01-SaoPaulo-auto-scaling-group20250125120655034300000003-20250125120951681100000004]
aws_autoscaling_policy.app1_SAO_scaling_policy: Refreshing state... [id=app1-cpu-target]
aws_lb_listener.CYBER_TYO_SYSLOG: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:261519058382:listener/net/CYBER-Tokyo-Network-LB/e795230110463110/32de8b7040e09b5a]
aws_route_table_association.public-ap-southeast-2b: Refreshing state... [id=rtbassoc-02ce60d4d5e2ef53a]
aws_route_table_association.public-ap-southeast-2a: Refreshing state... [id=rtbassoc-0b6529d85ff1d9896]
aws_route_table.private_Australia: Refreshing state... [id=rtb-0e7c19495163df123]
aws_route_table_association.private-ap-northeast-1c: Refreshing state... [id=rtbassoc-0124c32b49944b11a]
aws_route_table_association.private-ap-northeast-1a: Refreshing state... [id=rtbassoc-024862d17a7dde53e]
aws_autoscaling_attachment.ASG01_TYO_attachment: Refreshing state... [id=ASG01-Tokyo-auto-scaling-group20250125120825876500000005-20250125121012664300000007]
aws_autoscaling_policy.app1_TYO_scaling_policy: Refreshing state... [id=app1-cpu-target]
aws_autoscaling_group.ASG01_AUS: Refreshing state... [id=ASG01-Australia-auto-scaling-group20250125120743257600000003]
aws_route_table_association.public-ap-east-1a: Refreshing state... [id=rtbassoc-0226dec75db3b36d0]
aws_route_table_association.public-ap-east-1b: Refreshing state... [id=rtbassoc-05257f1bb4e97d7a7]
aws_route_table.private_HongKong: Refreshing state... [id=rtb-0f8861c82de45870f]
aws_autoscaling_policy.TYO_CYBER_scaling_policy: Refreshing state... [id=syslog-cpu-target]
aws_autoscaling_attachment.TYO_CYBER_attachment: Refreshing state... [id=Tokyo-CYBER-auto-scaling-group20250125120829092000000006-20250125121014937900000008]
aws_autoscaling_group.ASG01_HK: Refreshing state... [id=ASG01-HongKong-auto-scaling-group20250125120919267900000003]
aws_lb_listener.http_AUS: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-2:261519058382:listener/app/ASG01-Australia-load-balancer/da2bb45b4b7218e4/31e0e18716896e57]
aws_route53_record.app1_AUS: Refreshing state... [id=Z103851437PNELROEQ0AM_app1.devlab405.click_A_app1_AUS]
aws_route_table_association.private-ap-southeast-2b: Refreshing state... [id=rtbassoc-0d0d98cc32bcf7e39]
aws_route_table_association.private-ap-southeast-2a: Refreshing state... [id=rtbassoc-040de7b3fb29cad44]
aws_route53_record.app1_HK: Refreshing state... [id=Z103851437PNELROEQ0AM_app1.devlab405.click_A_app1_HK]
aws_lb_listener.http_HK: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-east-1:261519058382:listener/app/ASG01-HongKong-load-balancer/0d63ba5ba9a0a3ad/151a8dd6f1abf5d0]
aws_autoscaling_attachment.ASG01_AUS_attachment: Refreshing state... [id=ASG01-Australia-auto-scaling-group20250125120743257600000003-20250125120958590800000004]
aws_autoscaling_policy.app1_AUS_scaling_policy: Refreshing state... [id=app1-cpu-target]
aws_route_table_association.private-ap-east-1b: Refreshing state... [id=rtbassoc-03e4ead3b0a53ba6e]
aws_route_table_association.private-ap-east-1a: Refreshing state... [id=rtbassoc-00c195939ec89f092]
aws_autoscaling_attachment.ASG01_HK_attachment: Refreshing state... [id=ASG01-HongKong-auto-scaling-group20250125120919267900000003-20250125121050499500000004]
aws_autoscaling_policy.app1_HK_scaling_policy: Refreshing state... [id=app1-cpu-target]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_rds_cluster.pii_db_cluster will be created
  + resource "aws_rds_cluster" "pii_db_cluster" {
      + apply_immediately               = true
      + arn                             = (known after apply)
      + availability_zones              = (known after apply)
      + backup_retention_period         = 1
      + cluster_identifier              = "pii-db-cluster"
      + cluster_identifier_prefix       = (known after apply)
      + cluster_members                 = (known after apply)
      + cluster_resource_id             = (known after apply)
      + copy_tags_to_snapshot           = false
      + database_name                   = "pii_database"
      + db_cluster_parameter_group_name = (known after apply)
      + db_subnet_group_name            = "db-vpc-subnet-group"
      + deletion_protection             = false
      + enable_global_write_forwarding  = false
      + enable_http_endpoint            = false
      + endpoint                        = (known after apply)
      + engine                          = "aurora-mysql"
      + engine_mode                     = "provisioned"
      + engine_version                  = (known after apply)
      + engine_version_actual           = (known after apply)
      + hosted_zone_id                  = (known after apply)
      + iam_roles                       = (known after apply)
      + id                              = (known after apply)
      + kms_key_id                      = (known after apply)
      + master_password                 = (sensitive value)
      + master_username                 = "admin"
      + port                            = (known after apply)
      + preferred_backup_window         = (known after apply)
      + preferred_maintenance_window    = (known after apply)
      + reader_endpoint                 = (known after apply)
      + skip_final_snapshot             = true
      + storage_encrypted               = false
      + tags                            = {
          + "Environment" = "development"
          + "Purpose"     = "AWS RDS learning"
          + "Service"     = "MySQL Database"
        }
      + tags_all                        = {
          + "Environment" = "development"
          + "Purpose"     = "AWS RDS learning"
          + "Service"     = "MySQL Database"
        }
      + vpc_security_group_ids          = [
          + "sg-0c7034d1759101ac1",
        ]
    }

  # aws_rds_cluster_instance.pii_db_cluster_instance[0] will be created
  + resource "aws_rds_cluster_instance" "pii_db_cluster_instance" {
      + apply_immediately                     = true
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + cluster_identifier                    = "pii-db-cluster"
      + copy_tags_to_snapshot                 = false
      + db_parameter_group_name               = (known after apply)
      + db_subnet_group_name                  = "db-vpc-subnet-group"
      + dbi_resource_id                       = (known after apply)
      + endpoint                              = (known after apply)
      + engine                                = "aurora-mysql"
      + engine_version                        = (known after apply)
      + engine_version_actual                 = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = (known after apply)
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.r5.large"
      + kms_key_id                            = (known after apply)
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + performance_insights_enabled          = (known after apply)
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + preferred_backup_window               = (known after apply)
      + preferred_maintenance_window          = (known after apply)
      + promotion_tier                        = 0
      + publicly_accessible                   = false
      + storage_encrypted                     = (known after apply)
      + tags_all                              = (known after apply)
      + writer                                = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @statuc30721, Action: `pull_request`*